<script type="application/ld+json">
{
  "@context": "https://schema.org",
  "@type": "FAQPage",
  "mainEntity": [{
    "@type": "Question",
    "name": "What is the most common business type?",
    "acceptedAnswer": {
      "@type": "Answer",
      "text": "Technically speaking, the most common business structure is a sole proprietorship by a significant margin. However, this is primarily due to the ease in which someone can “fall into” this business type by simply doing business in their local area. The most common type of formalized business structure is the S corporation, which accounts for roughly 45% of all registered businesses."
    }
  }, {
    "@type": "Question",
    "name": "What is the most common structure for new businesses?",
    "acceptedAnswer": {
      "@type": "Answer",
      "text": "Most new business owners choose to register their businesses as either S corporations or LLCs depending on (1) how the registration will affect their taxes and (2) how they want to limit their personal liability in relation to their business. While around the same number of S corporations and LLCs are registered each year, LLCs are often seen as the recommended option for small business owners due to their inherent flexibility and lower barriers to entry."
    }
  }, {
    "@type": "Question",
    "name": "What is the difference between corporate and pass-through entities at the federal level?",
    "acceptedAnswer": {
      "@type": "Answer",
      "text": "A corporation (specifically referring to C corporations) is a legal entity that is wholly separate from its owners, and thus must pay taxes on any income it earns through the tax year. This means that the business itself must pay taxes at the end of the year. Further, the owners of the business must pay taxes on any dividends received as a result of their ownership, resulting in double taxation at both the corporate and personal level for any profits generated by the business. In comparison, a pass-through entity allows money to “pass through” the business without incurring a tax. This means that the owners of the pass-through entity must pay personal income taxes on any profits recorded by the entity. Put another way, while the entity must file a tax return to record any income it receives, it instead passes the profits (and associated taxes) on to the members and owners of the entity."
    }
  }, {
    "@type": "Question",
    "name": "Why are LLCs categorized under partnerships on IRS documents?",
    "acceptedAnswer": {
      "@type": "Answer",
      "text": "LLCs are registered and regulated at the state level, and were not recognized by the IRS until 1993 when they included them as a line item under partnerships. Specifically, LLCs embody the benefits of a partnership for tax purposes and the benefits of a corporation for legal liability purposes, meaning that at the federal level they are bundled with partnerships due to their taxation similarities. To further complicate this matter, the IRS adopted a “check-the-box” rule in 1997 that allowed LLCs to decide on whether they should be taxed as partnerships or corporations. For this reason, LLCs exist in an odd grey area between these two tax structures, and are normally categorized as partnerships on IRS documents."
    }
  }]
}
</script>
